In [178]:
from sqlalchemy import create_engine
engine = create_engine(
    "mysql+mysqlconnector://root:Rohankr11@localhost:3306/bengaluru_housing"
)

In [179]:
query = """
SELECT * from bengaluru_housing_cleaned;
"""

df_sql = pd.read_sql(query, engine)
df_sql

,area_type,availability,location,total_sqft,bath,balcony,price,bhk,price_per_sqft,sqft/bhk
0,Super built-up Area,Not Ready,Electronic City Phase II,1056.0,2.0,1.0,39.07,2,3699.810606,528.00
1,Plot Area,Ready,Chikka Tirupathi,2600.0,5.0,3.0,120.00,4,4615.384615,650.00
2,Built-up Area,Ready,Uttarahalli,1440.0,2.0,3.0,62.00,3,4305.555556,480.00
3,Super built-up Area,Ready,Lingadheeranahalli,1521.0,3.0,1.0,95.00,3,6245.890861,507.00
4,Super built-up Area,Ready,Kothanur,1200.0,2.0,1.0,51.00,2,4250.000000,600.00
...,...,...,...,...,...,...,...,...,...,...
13252,Built-up Area,Ready,Whitefield,3453.0,4.0,0.0,231.00,5,6689.834926,690.60
13253,Super built-up Area,Ready,Richards Town,3600.0,5.0,0.0,400.00,4,11111.111111,900.00
13254,Built-up Area,Ready,Raja Rajeshwari Nagar,1141.0,2.0,1.0,60.00,2,5258.545136,570.50
13255,Super built-up Area,Not Ready,Padmanabhanagar,4689.0,4.0,1.0,488.00,4,10407.336319,1172.25
13256,Super built-up Area,Ready,Doddathoguru,550.0,1.0,1.0,17.00,1,3090.909091,550.00

In [204]:
#what is the customer preference based on bhk size

query="""   
Select bhk,count(*) from bengaluru_housing_cleaned 
group by bhk order by count(*) desc
LIMIT 10;
"""
df_sql=pd.read_sql(query,engine)
df_sql

   bhk  count(*)
0    2      5518
1    3      4842
2    4      1412
3    1       647
4    5       352
5    6       220
6    7       100
7    8        88
8    9        52
9   10        14

In [214]:
#what is the customer preference based on number of bathrooms

query="""SELECT bath,count(*) as customer_count
from bengaluru_housing_cleaned 

group by bath
order by count(*) desc
LIMIT 10;
"""

df_sql=pd.read_sql(query,engine)
df_sql

   bath  customer_count
0   2.0            6950
1   3.0            3274
2   4.0            1222
3   1.0             781
4   5.0             521
5   6.0             269
6   7.0             102
7   8.0              64
8   9.0              41
9  10.0              13

In [218]:
#customer preference based on location 
query="""    
select location,count(*) as customer_count
from bengaluru_housing_cleaned
group by location
order by count(*) desc
limit 10;
"""
df_sql=pd.read_sql(query,engine)
df_sql

                location  customer_count
0             Whitefield             538
1         Sarjapur  Road             397
2        Electronic City             304
3         Kanakpura Road             271
4            Thanisandra             236
5              Yelahanka             212
6            Uttarahalli             186
7                 Hebbal             177
8           Marathahalli             175
9  Raja Rajeshwari Nagar             171

In [231]:
query=""" 
SELECT 
    CASE
        WHEN price < 20 THEN 'Below 20 Lakh'
        WHEN price >= 20 AND price < 40 THEN 'Between 20 and 40 Lakh'
        WHEN price >= 40 AND price < 60 THEN 'Between 40 and 60 Lakh'
        WHEN price >= 60 AND price < 80 THEN 'Between 60 and 80 Lakh'
        WHEN price >= 80 AND price < 100 THEN 'Between 80 and 100 Lakh'
        WHEN price >= 100 AND price < 120 THEN 'Between 100 and 120 Lakh'
        ELSE 'Above 120 Lakh'
    END AS price_range,
    COUNT(*) AS customer_count
FROM bengaluru_housing_cleaned
GROUP BY price_range
ORDER BY customer_count DESC;

"""
df_sql=pd.read_sql(query,engine)
df_sql

                price_range  customer_count
0            Above 120 Lakh            3402
1    Between 40 and 60 Lakh            3363
2    Between 60 and 80 Lakh            2547
3   Between 80 and 100 Lakh            1536
4    Between 20 and 40 Lakh            1404
5  Between 100 and 120 Lakh             847
6             Below 20 Lakh             158

In [213]:
#Which Bengaluru locations offer the best value for money in terms of price per square foot?
query="""  
SELECT location,
       FORMAT(AVG(price_per_sqft), 2) AS avg_price_per_sqft,
       FORMAT(AVG(price) * 100000, 0) AS avg_house_price_rs
FROM bengaluru_housing_cleaned
GROUP BY location
HAVING COUNT(*) > 20
ORDER BY AVG(price_per_sqft) ASC
LIMIT 10;
"""

df_sql = pd.read_sql(query, engine)
df_sql

                      location avg_price_per_sqft avg_house_price_rs
0                   Chandapura           3,116.30          3,401,555
1  Bommasandra Industrial Area           3,117.51          4,094,962
2                  Kammasandra           3,489.05          3,805,448
3                 Ananth Nagar           3,554.10          3,371,300
4                       Anekal           3,705.41          3,794,444
5     Electronic City Phase II           3,888.99          4,831,667
6                 Doddathoguru           3,913.22          4,341,300
7                     Attibele           3,939.41          4,643,667
8                Bisuvanahalli           4,047.86          4,172,510
9                   Begur Road           4,280.10          5,817,321

In [181]:
#Which locations are premium markets where buyers pay the highest price per square foot?
query="""
SELECT location,
FORMAT(AVG(price_per_sqft), 2) AS avg_price_per_sqft,
FORMAT(AVG(price) * 100000, 0) AS avg_house_price_rs
FROM bengaluru_housing_cleaned 
GROUP BY location
HAVING COUNT(*) > 20
ORDER BY AVG(price_per_sqft) DESC LIMIT 10;
""" 
df_sql = pd.read_sql(query, engine)
df_sql

               location avg_price_per_sqft avg_house_price_rs
0        Sarjapur  Road          36,391.87         11,938,155
1  2nd Stage Nagarbhavi          17,349.23         22,083,333
2          Indira Nagar          14,009.30         28,631,818
3          Rajaji Nagar          13,970.42         32,769,308
4          Malleshwaram          13,815.51         35,826,379
5    Basaveshwara Nagar          11,722.63         18,361,905
6           Basavangudi          11,155.43         18,435,938
7            Nagarbhavi          10,690.28         12,162,222
8           Koramangala          10,522.87         20,395,903
9           Frazer Town          10,335.89         24,864,143

In [182]:
#What BHK configuration (1, 2, 3, 4+) has the highest demand in the Bengaluru housing market?
query="""select bhk,count(*) as number_of_houses from bengaluru_housing_cleaned
group by bhk 
order by number_of_houses desc
LIMIT 8;""" 

query2=""" select 
case 
when bhk>=4 then '4+ BHK'
else concat(bhk,'BHK')
end as bhk_category,
count(*) as number_of_houses 
from bengaluru_housing_cleaned
group by bhk_category   
order by number_of_houses desc
LIMIT 8;    
"""
query3=""" select location,count(*) as number_of_houses 
from bengaluru_housing_cleaned
group by location
order by number_of_houses desc
LIMIT 10;"""

df_sql = pd.read_sql(query3, engine)
#df_sql = pd.read_sql(query2, engine)
df_sql

                location  number_of_houses
0             Whitefield               538
1         Sarjapur  Road               397
2        Electronic City               304
3         Kanakpura Road               271
4            Thanisandra               236
5              Yelahanka               212
6            Uttarahalli               186
7                 Hebbal               177
8           Marathahalli               175
9  Raja Rajeshwari Nagar               171

In [183]:
#Value for money
query=""" select location,
ROUND(AVG(total_sqft),0) as avg_sqft,
ROUND(AVG(price_per_sqft),2) as avg_price_per_sqft,
ROUND(AVG(total_sqft)/AVG(price_per_sqft),2) as value_for_money
from bengaluru_housing_cleaned
group by location
having COUNT(*)>20
order by value_for_money desc
LIMIT 10;

"""
df_sql= pd.read_sql(query, engine)
df_sql

                      location  avg_sqft  avg_price_per_sqft  value_for_money
0  Bommasandra Industrial Area    1401.0             3117.51             0.45
1                Iblur Village    2940.0             7365.60             0.40
2                     Sarjapur    1664.0             4803.41             0.35
3                       Gunjur    1619.0             4683.20             0.35
4              Old Madras Road    1997.0             5708.51             0.35
5                       Ulsoor    3551.0            10164.46             0.35
6                    Ardendale    2076.0             6010.17             0.35
7                     JP Nagar    2100.0             6246.87             0.34
8                    Yelahanka    1771.0             5387.02             0.33
9                   Chandapura    1034.0             3116.30             0.33

In [184]:
#Amenities Analysis
#bath 
query="""SELECT bath,
       ROUND(AVG(price) * 100000, 0) AS avg_price_rs,
       COUNT(*) AS listings
FROM bengaluru_housing_cleaned
GROUP BY bath
ORDER BY bath
limit 8;""" 
query2="""SELECT balcony,
       ROUND(AVG(price) * 100000, 0) AS avg_price_rs,
       COUNT(*) AS listings
FROM bengaluru_housing_cleaned
WHERE balcony>=1
GROUP BY balcony
ORDER BY balcony
limit 8;""" 
df_sql= pd.read_sql(query2, engine)
df_sql

   balcony  avg_price_rs  listings
0      1.0     8562700.0      4880
1      2.0    10980592.0      5100
2      3.0    15070757.0      1669

In [185]:
#underpriced or overpriced locations
query="""  SELECT b.location,
       b.price_per_sqft,
       ROUND(l.avg_pps, 2) AS location_avg_pps,
       ROUND((b.price_per_sqft - l.avg_pps), 2) AS deviation
FROM bengaluru_housing_cleaned b
JOIN (
    SELECT location, AVG(price_per_sqft) AS avg_pps
    FROM bengaluru_housing_cleaned
    GROUP BY location
) l
ON b.location = l.location
ORDER BY deviation DESC;

"""

df_sql= pd.read_sql(query, engine)
df_sql

                 location  price_per_sqft  location_avg_pps    deviation
0          Sarjapur  Road    1.200000e+07          36391.87  11963608.13
1             Srirampuram    2.300000e+06         481004.14   1818995.86
2              Whitefield    3.633333e+05           6854.63    356478.70
3      Suragajakkanahalli    6.727273e+05         339363.64    333363.64
4          Raghuvanahalli    1.764706e+05          38647.93    137822.66
...                   ...             ...               ...          ...
13252  Suragajakkanahalli    6.000000e+03         339363.64   -333363.64
13253         Srirampuram    7.692308e+04         481004.14   -404081.07
13254         Srirampuram    1.050505e+04         481004.14   -470499.09
13255         Srirampuram    9.259259e+03         481004.14   -471744.88
13256         Srirampuram    8.333333e+03         481004.14   -472670.81

[13257 rows x 4 columns]